app/Http/Controllers/HomeController.php

    public function index()
    {
        if (permission('dashboard-access')) {
            $this->setPageData('Dashboard','Dashboard','fas fa-tachometer-alt');
            $start_date = date('Y-m').'-01';
            $end_date = date('Y-m').'-31';

            $sale = Sale::toBase()->whereDate('created_at','>=',$start_date)
            ->whereDate('created_at','<=',$end_date)->sum('grand_total');

            $purchase = Purchase::toBase()->whereDate('created_at','>=',$start_date)
            ->whereDate('created_at','<=',$end_date)->sum('grand_total');

            $customer = Customer::toBase()->whereDate('created_at','>=',$start_date)
            ->whereDate('created_at','<=',$end_date)->get()->count();

            $supplier = Supplier::toBase()->whereDate('created_at','>=',$start_date)
            ->whereDate('created_at','<=',$end_date)->get()->count();

            $expense = Expense::toBase()->whereDate('created_at','>=',$start_date)
            ->whereDate('created_at','<=',$end_date)->sum('amount');
---
select sum(`grand_total`) as aggregate from `sales` where date(`created_at`) >= '2021-04-01' and date(`created_at`) <= '2021-04-31'
select sum(`grand_total`) as aggregate from `purchases` where date(`created_at`) >= '2021-04-01' and date(`created_at`) <= '2021-04-31'
select * from `customers` where date(`created_at`) >= '2021-04-01' and date(`created_at`) <= '2021-04-31'
select * from `suppliers` where date(`created_at`) >= '2021-04-01' and date(`created_at`) <= '2021-04-31'
select sum(`amount`) as aggregate from `expenses` where date(`created_at`) >= '2021-04-01' and date(`created_at`) <= '2021-04-31'

                $start_date = date('Y-m',$start).'-01';
                $end_date = date('Y-m',$start).'-31';

                $received_amount = DB::table('payments')->whereNotNull('sale_id')->whereDate('created_at','>=',$start_date)
                ->whereDate('created_at','<=',$end_date)->sum('amount');

                $sent_amount = DB::table('payments')->whereNotNull('purchase_id')->whereDate('created_at','>=',$start_date)
                ->whereDate('created_at','<=',$end_date)->sum('amount');

                $expense_amount = Expense::toBase()->whereDate('created_at','>=',$start_date)
                    ->whereDate('created_at','<=',$end_date)->sum('amount');

                $payroll_amount = Payroll::toBase()->whereDate('created_at','>=',$start_date)
                ->whereDate('created_at','<=',$end_date)->sum('amount');
---
select sum(`amount`) as aggregate from `payments` where `sale_id` is not null and date(`created_at`) >= '2020-10-01' and date(`created_at`) <= '2020-10-31'
select sum(`amount`) as aggregate from `payments` where `purchase_id` is not null and date(`created_at`) >= '2020-10-01' and date(`created_at`) <= '2020-10-31'
select sum(`amount`) as aggregate from `expenses` where date(`created_at`) >= '2020-10-01' and date(`created_at`) <= '2020-10-31'
select sum(`amount`) as aggregate from `payrolls` where date(`created_at`) >= '2020-10-01' and date(`created_at`) <= '2020-10-31'

                $start_date  = date('Y').'-'.date('m',$start).'-01';
                $end_date  = date('Y').'-'.date('m',$start).'-31';

                $sale_amount = DB::table('payments')->whereNotNull('sale_id')->whereDate('created_at','>=',$start_date)
                ->whereDate('created_at','<=',$end_date)->sum('amount');

                $purchase_amount = DB::table('payments')->whereNotNull('purchase_id')->whereDate('created_at','>=',$start_date)
                ->whereDate('created_at','<=',$end_date)->sum('amount');
---
select sum(`amount`) as aggregate from `payments` where `sale_id` is not null and date(`created_at`) >= '2021-01-01' and date(`created_at`) <= '2021-01-31'
select sum(`amount`) as aggregate from `payments` where `purchase_id` is not null and date(`created_at`) >= '2021-01-01' and date(`created_at`) <= '2021-01-31'